Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: When working on large result sets, you should consider using one of the functions that fetch an entire row (specified below).
es: Cuando se trabaja con conjuntos de resultados grandes, debería considerar el uso de las funciones que recuperen filas completas (especificadas más abajo).

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than msql_result().
es: Como estas funciones recuperan el contenido de varias celdas en una única llamada de función, son MUCHO más rápidas que msql_result().

source: Also, note that specifying a numeric offset for the field argument is much quicker than specifying a fieldname or tablename.fieldname argument.
es: Advierta también que especificar un desplazamiento numérico para el argumento campo (field) es mucho más rápido que especificar un argumento nombrecampo o nombretabla.nombrecampo.

source: Recommended high-performance alternatives: msql_fetch_row(), msql_fetch_array(), and msql_fetch_object().
es: Alternativas de alto-rendimiento recomendadas: msql_fetch_row(), msql_fetch_array(), y msql_fetch_object().

source: msql_select_db() sets the current active database on the server that's associated with the specified link identifier.
es: msql_select_db() establece la base de datos activa actual en el servidor que está asociada con el identificador de conexión (link identifier) suministrado.

source: If no link identifier is specified, the last opened link is assumed.
es: Si no se especifica el identificador de conexión, se asumne la última conexión abierta.

source: If no link is open, the function will try to establish a link as if msql_connect() was called, and use it.
es: Si no hay ninguna conexión abierta la función intentará establecer una conexión como si se hubiera llamado a sql_connect(), y la utiliza.

source: Every subsequent call to msql_query() will be made on the active database.
es: Cada llamada posterior a msql_query() se hará en la base de datos activa.

source: See also: msql_connect(), msql_pconnect(), and msql_query().
es: Véase también: msql_connect(), msql_pconnect(), y msql_query().

source: See msql_select_db().
es: Véase msql_select_db().

source: msql_tablename() takes a result pointer returned by the msql_list_tables() function as well as an integer index and returns the name of a table.
es: msql_tablename() toma un puntero resultado devuelto por la función msql_list_tables() como un índice entero y devuelve el nombre de una tabla.

source: The msql_numrows() function may be used to determine the number of tables in the result pointer.
es: La función msql_numrows() puede utilizarse para determinar el número de tablas del puntero resultado.

source: Example 1. msql_tablename() example
es: Ejemplo 1. msql_tablename() example

source: Returns:
es: Devuleve:

source: TRUE on success, FALSE on error.
es: TRUE si se finaliza con éxito, FALSE si se produce un error

source: mssql_close() closes the link to a MS SQL Server database that's associated with the specified link identifier.
es: mssql_close() cierra la conexión con una base de datos MS SQL Server que está asociada al identificador especificado.

source: mssql_close() will not close persistent links generated by mssql_pconnect().
es: mssql_close() no cerrará conexiones persistentes generadas por mssql_pconnect().

source: See also: mssql_connect(), mssql_pconnect().
es: Ver también: mssql_connect(), mssql_pconnect().

source: A positive MS SQL link identifier on success, or FALSE on error.
es: Un identificador de MSSQL si se ejecuta correctamente, o FALSE si se produce un error.

source: mssql_connect() establishes a connection to a MS SQL server.
es: mssql_connect() establece una conexión con MS SQL server.

source: The servername argument has to be a valid servername that is defined in the 'interfaces' file.
es: El argumento servername debe ser un nombre de servidor válido, que está definido en el fichero 'interfaces'.

source: In case a second call is made to mssql_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
es: En caso de hacer una segunda llamada a mssql_connect() con los mismos argumentos, no se establecerá una nueva conexión, sino que se devolverá el identificador de la conexión establecida anteriormente.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling mssql_close().
es: La conexión con el servidor se cerrará tan pronto como finalice el script, a menos que se cierre antes, mediante una llamada explicita a la función mssql_close().

source: See also mssql_pconnect(), mssql_close().
es: Ver también mssql_pconnect(), mssql_close().

source: TRUE on success, FALSE on failure.
es: TRUE si se ejecuta con éxito, FALSE si falla.

source: mssql_data_seek() moves the internal row pointer of the MS SQL result associated with the specified result identifier to point to the specified row number.
es: mssql_data_seek() mueve el puntero interno de la consulta MS SQL asociada al result_identifier especificado, para que apunte al número de fila especificada.

source: The next call to mssql_fetch_row() would return that row.
es: La siguiente llamada a mssql_fetch_row() devolverá esa fila.

source: See also: mssql_data_seek().
es: Ver también: mssql_data_seek().

source: Note: if the stored procedure returns parameters or a return value these will be available after the call to mssql_execute() Note: if the stored procedure returns parameters or a return value these will be available after the call to mssql_execute() unless the stored procedure returns more than one result set.
es: Nota: if the stored procedure returns parameters or a return value these will be available after the call to mssql_execute() Nota: if the stored procedure returns parameters or a return value these will be available after the call to mssql_execute() unless the stored procedure returns more than one result set.

source: An array that corresponds to the fetched row, or FALSE if there are no more rows.
es: Un array que corresponde a la fila capturada, o FALSE si no hay más filas.

source: mssql_fetch_array() is an extended version of mssql_fetch_row().
es: mssql_fetch_array() es una versión extendida de mssql_fetch_row().

source: An important thing to note is that using mssql_fetch_array() is NOT significantly slower than using mssql_fetch_row(), while it provides a significant added value.
es: Una observación a tener en cuenta es, que usar mssql_fetch_array() NO es más lento que usar mssql_fetch_row(), mientras que esta provee un valor a¤adido significativo.

source: For further details, also see mssql_fetch_row().
es: Para más detalles, ver también mssql_fetch_row()

source: Returns an object containing field information.
es: Devuleve un objeto que contiene información de los campos.

source: mssql_fetch_field() can be used in order to obtain information about fields in a certain query result.
es: mssql_fetch_field() se puede usar para obtener información acerca de los campos pertenecientes al resultado de una consulta.

source: If the field offset isn' t specified, the next field that wasn't yet retrieved by mssql_fetch_field() is retrieved.
es: Si el parámetro field_offset no es especificado, se devuelve la información del siguiente campo que todavía no ha sido devuelto por mssql_fetch_field().

source: name - column name. if the column is a result of a function, this property is set to computed#N, where #N is a serial number.
es: name - nombre de la columna. si la columna es el resultado de una función, esta propiedad vale #N, donde #N es un número de serie.

source: column_source - the table from which the column was taken
es: column_source - la tabla de donde se tomó la columna

source: max_length - maximum length of the column
es: max_length - longitud máxima de columna

source: numeric - 1 if the column is numeric
es: numeric - 1 si la columna es numérica

source: See also mssql_field_seek().
es: Ver también mssql_field_seek()

source: An object with properties that correspond to the fetched row, or FALSE if there are no more rows.
es: Un objeto con propiedades que se corresponden con la fila capturada, o FALSE si no hay más filas.

source: mssql_fetch_object() is similar to mssql_fetch_array(), with one difference - an object is returned, instead of an array.
es: mssql_fetch_object() es parecida a mssql_fetch_array(), con una diferencia - devuelve un objeto en vez de un array.

source: Speed-wise, the function is identical to mssql_fetch_array(), and almost as quick as mssql_fetch_row() (the difference is insignificant).
es: La función es idéntica a mssql_fetch_array(), y casi tan rápida como mssql_fetch_row() (la diferencia es insignificante).

source: See also: mssql_fetch-array() and mssql_fetch-row().
es: Ver también: mssql_fetch-array() and mssql_fetch-row().

source: mssql_fetch_row() fetches one row of data from the result associated with the specified result identifier.
es: mssql_fetch_row() captura una fila de datos pertenecientes al resultado asociado con el identificador de resultado especificado.

source: Subsequent call to mssql_fetch_rows() would return the next row in the result set, or FALSE if there are no more rows.
es: Siguientes llamadas a mssql_fetch_rows() devolverían las filas siguientes del result set, o FALSE si no hay mas filas.

source: See also: mssql_fetch_array(), mssql_fetch_object(), mssql_data_seek(), mssql_fetch_lengths(), and mssql_result().
es: Ver también: mssql_fetch_array(), mssql_fetch_object(), mssql_data_seek(), mssql_fetch_lengths(), and mssql_result().

source: mssql_field_length
es: Siguiente

source: If the next call to mssql_fetch_field() won't include a field offset, this field would be returned.
es: Si la siguiente llamada a mssql_fetch_field() no incluye el parámetro field_offset, lo que devuelve la función es el campo.

source: See also: mssql_fetch_field().
es: Ver también: mssql_fetch_field().

source: mssql_field_seek
es: Siguiente

source: mssql_free_result() only needs to be called if you are worried about using too much memory while your script is running.
es: mssql_free_result() sólo se necesita llamarla si le preocupa el estar usando mucha memoria mientras se está ejecutando el script.

source: You may call mssql_free_result() with the result identifier as an argument and the associated result memory will be freed.
es: Toda el resultado en memoria será liberado automaticamente cuando finalice el script, puede llamar a mssql_free_result() con el identificador de la consulta como argumento y la consulta asociada será liberada de la memoria.

source: mssql_free_statement
es: Siguiente

source: mssql_init
es: Siguiente

source: mssql_min_message_severity
es: Subir

source: mssql_min_error_severity
es: Siguiente

source: Example 1. mssql_next_result() example
es: Ejemplo 1. mssql_next_result() example

source: mssql_num_fields() returns the number of fields in a result set.
es: mssql_num_fields() devuelve el número de campos de la consulta o result set.

source: See also: mssql_db_query(), mssql_query(), mssql_fetch_field(), and mssql_num_rows().
es: Ver también: mssql_db_query(), mssql_query(), mssql_fetch_field(), mssql_num_rows().

source: mssql_num_rows() returns the number of rows in a result set.
es: mssql_num_rows() devuelve el número de filas de la consulta o result set.

source: See also: mssql_db_query(), mssql_query(), and mssql_fetch_row().
es: Ver también: mssql_db_query(), mssql_query() and, mssql_fetch_row().

source: A positive MS SQL persistent link identifier on success, or FALSE on error.
es: Un identificador persistente postivo si no hay error, o FALSE si se produce alguno

source: mssql_pconnect() acts very much like mssql_connect() with two major differences.
es: mssql_pconnect() funciona de la misma forma que mssql_connect() aunque con dos grandes diferencias.

source: Instead, the link will remain open for future use (mssql_close() will not close links established by mssql_pconnect()).
es: En vez de esto, el enlace permanecerá abierto para un uso futuro. (mssql_close() no cerrará enlaces establecidos por mssql_pconnect()).

source: A positive MS SQL result identifier on success, or FALSE on error.
es: Un identificado de resultado valido si no hay error, o FALSE en caso contrario.

source: mssql_query() sends a query to the currently active database on the server that's associated with the specified link identifier.
es: mssql_query() envia una petición de consulta a la base de datos activa en el servidor asociada al identificador de enlace especificado.

source: If no link is open, the function tries to establish a link as if mssql_connect() was called, and use it.
es: Si no hay ningún enlace abierto, la función intenta establecer un enlace como si mssql_connect() hubiera sido llamada, y lo usa.

source: See also: mssql_db_query(), mssql_select_db(), and mssql_connect().
es: Ver también: mssql_db_query(), mssql_select_db(), and mssql_connect().

source: mssql_result() returns the contents of one cell from a MS SQL result set.
es: El contenido de la celda en la fila y posición del result set especificado.

source: The field argument can be the field' s offset, the field's name or the field's table dot field's name (tablename.fieldname).
es: El parametro field puede ser la posición del campo, o el nombre del campo o bién nombretabla.nombrecampo.

source: If the column name has been aliased ('select foo as bar from.. .'), it uses the alias instead of the column name.
es: Si el nombre de la columna ha sido renombrado ('select foo as bar from.. .'), use el alias en vez del nombre de la columna.

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than mssql_result().
es: Como estas funciones devuelven el contenido de múltiples celdas en una sóla llamada, estas son MUCHO más rápidas que mssql_result().

source: Recommended high-performance alternatives: mssql_fetch_row(), mssql_fetch_array(), and mssql_fetch_object().
es: Alternativas recomendadas para mayor rendimiento: mssql_fetch_row(), mssql_fetch_array(), y mssql_fetch_object().

source: TRUE on success, FALSE on error
es: TRUE si todo va bién, FALSE si se produce un error

source: mssql_select_db() sets the current active database on the server that's associated with the specified link identifier.
es: mssql_select_db() selecciona como base de datos activa del servidor, la que está asociada al identificador de enlace especificado.

source: If no link is open, the function will try to establish a link as if mssql_connect() was called, and use it.
es: Si no hay ningún enlace abierto, la función intentará establecer un enlace como si se llamara a la función mssql_connect(), y lo usa.

source: Every subsequent call to mssql_query() will be made on the active database.
es: Cada llamada a mssql_query() será realizada sobre la base de datos activa.

source: See also: mssql_connect(), mssql_pconnect(), and mssql_query()
es: Ver también: mssql_connect(), mssql_pconnect(), y mssql_query()

source: Returns the maximum value that can be returned by a call to mt_rand().
es: Devuelve el valor máximo que se puede obtener con una llamada a mt_rand().

source: See also mt_rand(), mt_srand() and getrandmax().
es: Vea también mt_rand(), mt_srand() rand(), srand() y getrandmax().

source: Many random number generators of older libcs have dubious or unknown characteristics and are slow.
es: Muchos generadores de números aleatorios de libcs antiguas tienen características dudosas o desconocidas y son lentas.

source: By default, PHP uses the libc random number generator with the rand() By default, PHP uses the libc random number generator with the rand() function.
es: Por defecto, PHP usa el generador de números aleatorios de libc con la función rand().

source: The mt_rand() function is a drop-in replacement for this.
es: La función mt_rand() es un reemplazo para esta.

source: It uses a random number generator with known characteristics using the Mersenne Twister, which will produce random numbers that should be suitable for seeding some kinds of cryptography (see the home page for details) and is four times faster than what the average libc provides.
es: Usa un generador de números aleatorios con características conocidas, el Tornado de Mersenne, que es capaz de producir números aleatorios que incluso se pueden emplear para propósitos criptográficos y es cuatro veces más rápido que la media de los que provee libc.

source: If you want a random number between 5 and 15 (inclusive), for example, use mt_rand (5, 15).
es: La página principal del Tornado de Mersenne puede encontrarse en http: / /www.math.keio.ac.jp / ~matumoto / emt.html, y una versión optimizada del código del TM esta disponible en http: / /www.scp.syr.edu / ~marc / hawk / twister.html.

source: Since 4.2.0 this is no longer necessary.
es: Si es llamada sin los parámetros opcionales min y max mt_rand() devuelve un valor pseudo-aleatorio entre 0 y RAND_MAX.

source: In versions before 3.0.7 the meaning of max was range.
es: Si quiere un número aleatorio entre 5 y 15 (inclusive), use mt_rand(5,15).

source: To get the same results in these versions the short example should be mt_rand (5, 11) to get a random number between 5 and 15.
es: Recuerde introducir la semilla del generador de números aleatorios antes de usar la instrucción con mt_srand().

source: See also mt_srand(), mt_getrandmax() and rand().
es: Vea también mt_srand(), mt_getrandmax(), srand(), rand() y getrandmax().

source: Seeds the random number generator with seed.
es: Introduce la semilla seed en el generador de números aleatorios mejorado.

source: See also mt_rand(), mt_getrandmax() and srand().
es: Vea también mt_rand(), mt_getrandmax(), srand(), rand() y getrandmax().

source: Network Functions
es: Funciones de Red

source: If the last query was a DELETE query with no WHERE clause, all of the records will have been deleted from the table but this function will return zero.
es: mysql_affected_rows() devuelve el número de filas afectadas en la ultima sentencia INSERT, UPDATE o DELETE sobre el servidor asociado con el identificador de enlace especificado.

source: When using UPDATE, MySQL will not update columns where the new value is the same as the old value.
es: Si el identificador de enlace no ha sido especificado, se asume por defecto el último enlace.

source: mysql_affected_rows() does not work with SELECT statements; only on statements which modify records.
es: Si la última sentencia fue un DELETE sin clausula WHERE, todos los registros han sido borrados de la tabla pero esta función devolvera cero.

source: If the last query failed, this function will return -1.
es: Este comando no es efectivo para las sentencias SELECT, sino sólo para las sentencias que modifican registros.

source: Records deleted:
es: Para conseguir el número de lineas devueltos por un SELECT, usar mysql_num_rows().

source: mysql_change_user() changes the logged in user of the current active connection, or the connection given by the optional link_identifier parameter.
es: mysql_change_user() cambia el usuario conectado en la actual conexión activa, o si se especifica, en la conexión determinada por el identificador de enlace.

source: If a database is specified, this will be the current database after the user has been changed.
es: Si se especifica la base de datos, esta será la base por defecto después del cambio de usuario.

source: It is not available in PHP 4.
es: Esta función fue introducida en PHP 3.0.13 y requiere MySQL 3.23.3 o superior.

source: Example 1. mysql_client_encoding() example
es: Ejemplo 1. mysql_client_encoding() example

source: mysql_close() closes the connection to the MySQL server that's associated with the specified link identifier.
es: mysql_close() cierra el enlace con la base MySQL que esta asociada con el identificador de enlace especificado.

source: If link_identifier isn 't specified, the last opened link is used.
es: Si no se especifica el identificador de enlace, se asume por defecto el último enlace.

source: Using mysql_close() isn't usually necessary, as non-persistent open links are automatically closed at the end of the script's execution.
es: Normalmente no es necesario ya que la aperturas no-persistentes son cerradas automaticamente al final de la ejecución del script.

source: See also freeing resources.
es: mysql_close() no cerrará los enlaces persistentes generados con mysql_pconnect().

source: MySQL close example
es: Ejemplo de MySQL close

source: ?php $link = mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); print ("Connected successfully"); mysql_close($link);?
es: ?php $link = mysql_connect ("kraemer", "marliesle", "secret") {or die ("Could not connect");} print ("Connected successfully"); mysql_close ($link);?

source: See also: mysql_connect(), and mysql_pconnect().
es: Ver también: mysql_connect(), y mysql_pconnect().

source: Returns a MySQL link identifier on success, or FALSE on failure.
es: Un identificador de enlace positivo si tiene exito, o falso si error.

source: mysql_connect() establishes a connection to a MySQL server.
es: mysql_connect() establece una conexión a un servidor MySQL.

source: The following defaults are assumed for missing optional parameters: server = 'localhost:3306', username = name of the user that owns the server process and password = empty password.
es: Todos los argumentos son opcionales, y si no hay, se asumen los valores por defecto ('localhost', usuario propietario del proceso del servidor, password vacia).

source: Support for ":port" was added in PHP 3.0B4.
es: Nota:

source: Support for ": / path / to / socket" was added in PHP 3.0.10.
es: Soporte para ":puerto" fue añadido en PHP 3.0B4.

source: You can suppress the error message on failure by prepending a @ to the function name.
es: Soporte para ": / camino / al / socket" fue añadido en PHP 3.0.10.

source: The new_link parameter modifies this behavior and makes mysql_connect() always open a new link, even if mysql_connect() was called before with the same parameters.
es: En el caso de que se haga una llamada a mysql_connect() con los mismos argumentos, no se establecerá un nuevo enlace, sino que se devolverá el enlace ya abierto.

source: The client_flags parameter became available in PHP 4.3.0
es: Ejemplo 1.

source: See also mysql_pconnect() and mysql_close().
es: Ver también: mysql_pconnect(), y mysql_close().

source: MySQL create database example
es: Ejemplo de MySQL create

source: For downwards compatibility mysql_createdb() can also be used.
es: ?php $link = mysql_pconnect ("kron", "jutta", "geheim") {or die ("Could not connect");} if (mysql_create_db ("my_db")) {print ("Database created successfully\n");} else {printf ("Error creating database: %s\n", mysql_error ());}?

source: The function mysql_create_db() is deprecated.
es: Por razones de compatibilidad puede usarse mysql_createdb() igualmente.

source: See also: mysql_drop_db(), mysql_query().
es: Ver también: mysql_drop_db().

source: The next call to mysql_fetch_row() would return that row.
es: mysql_data_seek() mueve el puntero de fila interno a la fila especificada para el identificador de resultado.

source: The row_number should be a value in the range from 0 to mysql_num_rows - 1.
es: La próxima llamada a mysql_fetch_row() devolverá esa fila.

source: The function mysql_data_seek() can be used in conjunction only with mysql_query(), not with mysql_unbuffered_query().
es: numero_de_fila empieza en 0.

source: MySQL data seek example
es: Ejemplo de MySQL data seek
